---
kind: method
id: M:Autodesk.Revit.DB.ElementSet.Erase(Autodesk.Revit.DB.Element)
source: html/342014c6-d1e8-300f-65f4-46c99b5cee07.htm
---
# Autodesk.Revit.DB.ElementSet.Erase Method

Removes a specified element from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	Element item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Element`) - The element to be erased.

## Returns
The number of elements that were erased from the set.